app/Helpers/bitacora_helper.php

    function registrar_bitacora(string $accion, string $modulo, string $descripcion = null, $referencia_id = null)
    {
        $model = new BitacoraSistemaModel();
        $request = service('request');

        $model->insert([
            'user_id'      => session('id') ?? null,
            'accion'       => $accion,
            'modulo'       => $modulo,
            'descripcion'  => $descripcion,
            'referencia_id' => $referencia_id,
            'ip_address'   => $request->getIPAddress(),
            'user_agent'   => $request->getUserAgent()->getAgentString(),
        ]);
---
INSERT INTO `bitacora_sistema` (`user_id`, `accion`, `modulo`, `descripcion`, `referencia_id`, `ip_address`, `user_agent`) VALUES ('1', 'Iniciar sesión', 'Autenticacion', 'Inició sesión.', '1', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/141.0.0.0 Safari/537.36')