app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `email` = 'gerente'
OR `user_name` = 'gerente'
 LIMIT 1
---
    public function login()
    {
        helper(['form']);
        $session = session();
        $userModel = new UserModel();
        $permisoModel = new PermisoRolModel();

        if (!$this->request->is('post')) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'Método no permitido.'
            ]);
        }

        $username = trim($this->request->getPost('username'));
        $password = trim($this->request->getPost('password'));

        if (empty($username) || empty($password)) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'Usuario y contraseña son requeridos.'
            ]);
        }

        $user = $userModel
            ->groupStart()
            ->where('email', $username)
            ->orWhere('user_name', $username)
            ->groupEnd()
            ->first();