app/Controllers/BitacoraController.php

SELECT COUNT(*) AS `numrows`
FROM `bitacora_sistema`
LEFT JOIN `users` ON `users`.`id` = `bitacora_sistema`.`user_id`
SELECT `bitacora_sistema`.*, `users`.`user_name` as `usuario`
FROM `bitacora_sistema`
LEFT JOIN `users` ON `users`.`id` = `bitacora_sistema`.`user_id`
ORDER BY `bitacora_sistema`.`created_at` DESC
 LIMIT 10, 10
---
    public function index()
    {
        $bitacoraModel = new BitacoraSistemaModel();

        // ✅ Selector de cantidad por página (por defecto 10)
        $perPage = $this->request->getGet('per_page') ?? 10;

        // ✅ Traer registros con JOIN para mostrar nombre de usuario
        $data['bitacoras'] = $bitacoraModel
            ->select('bitacora_sistema.*, users.user_name as usuario')
            ->join('users', 'users.id = bitacora_sistema.user_id', 'left')
            ->orderBy('bitacora_sistema.created_at', 'DESC')
            ->paginate($perPage);