app/Controllers/BranchController.php

    public function index()
    {
        $data['branches'] = $this->branchModel->findAll();
---
SELECT *
FROM `branches`

    public function delete()
    {
        $session = session();
        $id = $this->request->getPost('id');
        $branchModel = new branchModel();

        if (!$id) {
            return $this->response->setJSON(['status' => 'error', 'message' => 'ID inválido.']);
        }
        $branch = $branchModel->find($id);
        if ($branchModel->delete($id)) {
---
SELECT *
FROM `branches`
WHERE `branches`.`id` = '8'
DELETE FROM `branches`
WHERE `id` IN ('8')