app/Controllers/CashierController.php

SELECT `cashier`.*, `users`.`user_name`, `branches`.`branch_name`
FROM `cashier`
LEFT JOIN `users` ON `users`.`id` = `cashier`.`user_id`
JOIN `branches` ON `branches`.`id` = `cashier`.`branch_id`
---
    public function index()
    {
        $cashiers = $this->cashierModel
            ->select('cashier.*, users.user_name, branches.branch_name')
            ->join('users', 'users.id = cashier.user_id', 'left')
            ->join('branches', 'branches.id = cashier.branch_id')
            ->findAll();

SELECT *
FROM `branches`
SELECT *
FROM `users`
---
    public function new()
    {
        $branches = $this->branchModel->findAll();
        $users = $this->userModel->findAll();

SELECT *
FROM `cashier`
WHERE `cashier`.`id` = '1'
SELECT *
FROM `branches`
SELECT *
FROM `users`
---
    public function edit($id)
    {
        // 1. Obtener la caja a editar
        $cashier = $this->cashierModel->find($id);

        if (!$cashier) {
            return redirect()->to('/cashiers')->with('error', 'Caja no encontrada.');
        }

        // 2. Obtener la lista de ramas y usuarios (para los dropdowns)
        $branches = $this->branchModel->findAll();
        $users = $this->userModel->findAll();