app/Controllers/SellerController.php

    public function index()
    {
        $data['sellers'] = $this->sellerModel->findAll();
---
SELECT *
FROM `sellers`