app/Controllers/UserController.php

SELECT `users`.`id`, `users`.`user_name`, `users`.`email`, `roles`.`nombre` AS `role_name`
FROM `users`
JOIN `roles` ON `roles`.`id` = `users`.`role_id`
---
    public function index()
    {
        $chk = requerirPermiso('ver_usuarios');
        if ($chk !== true) return $chk;

        // 1. Instanciamos el modelo de usuario.
        $userModel = new UserModel();

        $users = $userModel
            ->select('users.id, users.user_name, users.email, roles.nombre AS role_name, branches.branch_name AS branch_name')
            ->join('roles', 'roles.id = users.role_id')
            ->join('branches', 'branches.id = users.branch_id')
            ->findAll();