app/Models/UserModel.php

SELECT `users`.*, `roles`.`nombre` AS `role_name`, `branches`.`branch_name`, `branches`.`branch_direction`
FROM `users`
JOIN `roles` ON `roles`.`id` = `users`.`role_id`
LEFT JOIN `branches` ON `branches`.`id` = `users`.`branch_id`
WHERE `users`.`email` = 'gerente@mail.com'
 LIMIT 1
---
    public function getUserWithRoleAndBranch($email)
    {
        return $this->select('users.*, roles.nombre AS role_name, branches.branch_name, branches.branch_direction')
                    ->join('roles', 'roles.id = users.role_id')
                    ->join('branches', 'branches.id = users.branch_id', 'left') // LEFT JOIN para ser más seguro
                    ->where('users.email', $email)
                    ->first();